AIRService/Connected Services/WebService.WSOTA_AirAvailLLSRQ/OTA_AirAvailLLS2.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:sws_xsd="http://webservices.sabre.com/sabreXML/2011/10" xmlns:sws="https://webservices.sabre.com/websvc" targetNamespace="https://webservices.sabre.com/websvc" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema>
      <xsd:import schemaLocation="OTA_AirAvailLLS2.4.0RQRS.xsd" namespace="http://webservices.sabre.com/sabreXML/2011/10" />
      <xsd:import schemaLocation="msg-header-2_0.xsd" namespace="http://www.ebxml.org/namespaces/messageHeader" />
      <xsd:import schemaLocation="wsse.xsd" namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" />
      <xsd:import schemaLocation="STL_For_SabreProtocol_v.1.2.0.xsd" namespace="http://services.sabre.com/STL/v01" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="OTA_AirAvailInput">
    <wsdl:part name="header" element="eb:MessageHeader" />
    <wsdl:part name="header2" element="wsse:Security" />
    <wsdl:part name="body" element="sws_xsd:OTA_AirAvailRQ" />
  </wsdl:message>
  <wsdl:message name="OTA_AirAvailOutput">
    <wsdl:part name="header" element="eb:MessageHeader" />
    <wsdl:part name="header2" element="wsse:Security" />
    <wsdl:part name="body" element="sws_xsd:OTA_AirAvailRS" />
  </wsdl:message>
  <wsdl:portType name="OTA_AirAvailPortType">
    <wsdl:operation name="OTA_AirAvailRQ">
      <wsdl:input message="sws:OTA_AirAvailInput" />
      <wsdl:output message="sws:OTA_AirAvailOutput" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="OTA_AirAvailSoapBinding" type="sws:OTA_AirAvailPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="OTA_AirAvailRQ">
      <soap:operation soapAction="OTA_AirAvailLLSRQ" />
      <wsdl:input>
        <soap:header message="sws:OTA_AirAvailInput" part="header" use="literal" />
        <soap:header message="sws:OTA_AirAvailInput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </wsdl:input>
      <wsdl:output>
        <soap:header message="sws:OTA_AirAvailOutput" part="header" use="literal" />
        <soap:header message="sws:OTA_AirAvailOutput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="OTA_AirAvailService">
    <wsdl:port name="OTA_AirAvailPortType" binding="sws:OTA_AirAvailSoapBinding">
      <soap:address location="https://webservices.havail.sabre.com/websvc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>